export type languagesType = {
    name: string;
    shortName: string;
    code: string;
}

export const languages = [
   { id: 1, name: 'Русский', shortName: 'РУС', code: 'rus'},
   { id: 2, name: 'Қазақша', shortName: 'КАЗ', code: 'kaz'},
]

export const localization: any = {
    titlePhone: {rus: 'бесплатно с мобильного', kaz: 'ұялы телефоннан тегін'},

    banerTitleBeforeColored: {rus: 'Онлайн очередь по ипотеке ', kaz: ''},
    banerTitleColored: {rus: '7-20-25', kaz: '7-20-25'},
    banerTitleAfterColored: {rus: '', kaz: ' ипотекасы бойынша онлайн кезек'},

    goToFormButton: {rus: 'Подать заявку на очередь', kaz: 'Кезекке өтінім беру'},

    banerSubTitle: {rus: 'Для оформления ипотеки в рамках выделенных средств', kaz: 'Бөлінген қаражат шегінде ипотека ресімдеу үшін'},

    shieldTitle_0: {rus: '7% годовых', kaz: 'Жылдық 7%'},
    shieldSubTitle_0: {rus: 'Ставка вознаграждения', kaz: 'Сыйақы мөлшерлемесі'},
    shieldTitle_1: {rus: 'от 20%', kaz: '20%-дан'},
    shieldSubTitle_1: {rus: 'Первоначальный взнос', kaz: 'бастап Бастапқы жарна'},
    shieldTitle_2: {rus: 'до 25 лет', kaz: '25 жылға дейін'},
    shieldSubTitle_2: {rus: 'Срок кредита', kaz: 'Кредит мерзімі'},

    commonTermsTitle: {rus: 'Общие условия онлайн очереди', kaz: 'Онлайн кезектің жалпы шарттары'},
    commonTermsTitle_0: {rus: 'Лимит средств выделен Оператором АО Казахстанский Фонд устойчивости', kaz: 'Қаражат лимитін «Қазақстанның тұрақтылық қоры» АҚ Операторы бөлді'},
    commonTermsTitle_1: {rus: 'Прием заявок на очередь будет закрыт после достижения выделенного лимита', kaz: 'Бөлінген лимитке жеткеннен кейін, кезекке өтінімдерді қабылдау жабылады'},
    commonTermsTitle_2: {rus: 'Номер очереди будет действовать 10 рабочих дней с момента приглашения в отделение Банка', kaz: 'Кезек нөмірі Банк бөлімшесіне шақырылған сәттен бастап 10 жұмыс күні жарамды болады'},
    commonTermsTitleBeforeLink_3: {rus: 'В случае отказа от Банка и несоответствия ', kaz: 'Банк бас тартып, '},
    commonTermsTitleLink_3: {rus: 'условиям', kaz: 'шарттар'},
    commonTermsTitleAfterLink_3: {rus: ' номер очереди будет аннулирован', kaz: ' орындалмаған жағдайда, кезек нөмірі жойылады'},

    commonTermsSubTitleBeforeLink_3: {rus: 'Получить решение по ипотеке можно только после подачи ', kaz: 'Ипотека бойынша шешімді '},
    commonTermsSubTitleLink_3: {rus: 'заявки на онлайн очередь', kaz: 'онлайн кезекке'},
    commonTermsSubTitleAfter_3: {rus: '', kaz: ' өтінім бергеннен кейін ғана алуға болады'},
    
    
    requirements: {rus: 'Требования к недвижимости', kaz: 'Жылжымайтын мүлікке қойылатын талаптар'},
    requirements_0: {rus: 'Объект введен в эксплуатацию', kaz: 'Объект пайдалануға берілген болуы тиіс'},
    requirements_1: {rus: 'Все строительные работы в здании завершены', kaz: 'Ғимараттағы барлық құрылыс жұмыстары аяқталған болуы тиіс'},
    requirements_2: {rus: 'Наличие полного пакета документов', kaz: 'Құжаттардың толық пакетінің болуы'},

    howToApply: {rus: 'Как подать заявку?', kaz: 'Қалай өтінім беруге болады?'},
    howToApplyTitle_0: {rus: 'Заполните заявку', kaz: 'Өтінімді толтырыңыз'},
    howToApplySubTitle_0: {rus: 'Определите сумму кредита и заполните личные данные', kaz: 'Кредит сомасын белгілеп, жеке деректерді толтырыңыз'},
    howToApplyTitle_1: {rus: 'Получите номер в очереди', kaz: 'Кезектегі нөмірді алыңыз'},
    howToApplySubTitle_1: {rus: 'Мы выдадим номер Вашей онлайн очереди', kaz: 'Біз Сіздің онлайн кезектегі нөміріңізді береміз'},
    howToApplyTitle_2: {rus: 'Дождитесь звонка от менеджера', kaz: 'Менеджердің қоңырауын күтіңіз'},
    howToApplySubTitle_2: {rus: 'Для подачи основной заявки по ипотеке пригласим Вас в отделение Банка', kaz: 'Ипотека бойынша негізгі өтінімді беру үшін біз Сізді Банк бөлімшесіне шақырамыз'},
    
    helpfullInfo: {rus: 'Полезная информация', kaz: 'Пайдалы ақпарат'},

    helpfullInfoTerms: {rus: 'Условия', kaz: 'Шарттары'},
    helpfullInfoTermsTitle_0: {rus: 'Сумма кредита', kaz: 'Кредит сомасы'},
    helpfullInfoTermsSubTitle_0: {rus: 'до 20 млн тенге', kaz: '20 млн теңгеге дейін'},
    helpfullInfoTermsTitle_1: {rus: 'Срок кредита', kaz: 'Кредит мерзімі'},
    helpfullInfoTermsSubTitle_1: {rus: 'от 3х месяцев до 25 лет', kaz: '3 айдан 25 жылға дейін'},
    helpfullInfoTermsTitle_2: {rus: 'Ставка', kaz: 'Мөлшерлемесі'},
    helpfullInfoTermsSubTitle_2: {rus: '7% годовых', kaz: 'жылдық 7%'},
    helpfullInfoTermsTitle_3: {rus: 'ГЭСВ', kaz: 'СЖТМ'},
    helpfullInfoTermsSubTitle_3: {rus: 'от 7.2%', kaz: '7,2%-дан бастап'},
    helpfullInfoTermsTitle_4: {rus: 'Первоначальный взнос', kaz: 'Бастапқы жарна'},
    helpfullInfoTermsSubTitle_4: {rus: 'от 20%', kaz: '20%-дан бастап'},

    helpfullInfoTermsMaxPrice: {rus: 'Максимальная стоимость недвижимости', kaz: 'Жылжымайтын мүліктің ең үлкен құны'},

    helpfullInfoTermsMaxPrice_0: {rus: '25 млн тенге для городов Астана, Алматы и их пригородных зон в пределах границ, Актау, Атырау, Шымкент', kaz: 'Астана, Алматы қалалары және олардың шекаралары шегіндегі қала маңындағы аудандар, Ақтау, Атырау, Шымкент қалалары үшін 25 млн теңге'},
    helpfullInfoTermsMaxPrice_1: {rus: '20 млн тенге для городов Караганда и Туркестан', kaz: 'Қарағанды және Түркістан қалалары үшін 20 млн теңге'},
    helpfullInfoTermsMaxPrice_2: {rus: '15 млн тенге для других регионов, в том числе Туркестанская область', kaz: 'Басқа өңірлер, соның ішінде Түркістан облысы үшін 15 млн теңге'},
    
    helpfullInfoDocuments: {rus: 'Необходимые документы', kaz: 'Қажетті құжаттар'},
    helpfullInfoDocuments_0: {rus: 'Удостоверение личности/Паспорт всех участников займа (заемщик, гарант)', kaz: 'Барлық қарызға қатысушылардың жеке куәлігі/төлқұжаты (қарыз алушы, кепілгер)'},
    helpfullInfoDocuments_1: {rus: 'Свидетельство о браке - при наличии брака', kaz: 'Неке туралы куәлік - егер некеде болса'},
    helpfullInfoDocuments_2: {rus: 'Справка о зарегистрированных правах обременения на недвижимое имущество от продавца', kaz: 'Сатушыдан жылжымайтын мүлікке тіркелген ауыртпалық құқықтары туралы анықтама'},
    helpfullInfoDocuments_3: {rus: 'Отчет об оценке независимой оценочной компании', kaz: 'Тәуелсіз бағалау компаниясының бағалау туралы есебі'},
    helpfullInfoDocuments_4: {rus: 'Справка об отсутствии недвижимости по РК', kaz: 'ҚР бойынша жылжымайтын мүліктің жоқтығы туралы анықтама'},
    helpfullInfoDocuments_5: {rus: 'Технический паспорт на квартиру', kaz: 'Пәтердің техникалық төлқұжаты'},
    helpfullInfoDocuments_6: {rus: 'Квартирный листок, либо предварительный договор купли-продажи, в котором отображена стоимость недвижимости', kaz: 'Пәтер парағы немесе жылжымайтын мүліктің құны көрсетілген алдын ала сатып алу-сату шарты'},

    helpfullInfoRequirements: {rus: 'Требования к заемщику', kaz: 'Қарыз алушыға қойылатын талаптар'},
    helpfullInfoRequirements_0: {rus: 'Возраст от 18 до 68 лет на момент окончания займа', kaz: 'Жасы 18-ге толған, ал қарыз мерзімі аяқталған кезде 68-ден аспаған болуы тиіс'},
    helpfullInfoRequirements_1: {rus: 'Доход за последние 6 месяцев', kaz: 'Соңғы 6 айдағы кірісі'},
    helpfullInfoRequirements_2: {rus: 'Отсутствие факта участия в программе ранее в роли заемщика', kaz: 'Бұрын қарыз алушы ретінде Бағдарламаға қатысу фактісі болмауы тиіс'},
    helpfullInfoRequirements_3: {rus: 'Отсутствие жилой недвижимости в собственности', kaz: 'Жылжымайтын тұрғын мүлкі болмауы тиіс'},
    helpfullInfoRequirements_4: {rus: 'Отсутствие действующих ипотечных жилищных займов', kaz: 'Қолданыстағы ипотекалық тұрғын үй қарыздары болмауы тиіс'},
    helpfullInfoRequirements_5: {rus: 'Возможность привлечения гарантов до 4 человек', kaz: '4 адамға дейін кепілгер тарту мүмкіндігі'},


    ifYouHaveQuestions: {rus: 'Если у Вас возникли вопросы', kaz: 'Сұрақтарыңыз болса,'},
    ifYouHaveQuestions_0: {rus: 'Вам поможет менеджер', kaz: 'Сізге менеджер көмектеседі'},
    ifYouHaveQuestions_1: {rus: 'бесплатно с мобильного  24/7', kaz: 'ұялы телефоннан 24/7 тегін'},
    ifYouHaveQuestions_2: {rus: 'Напишите нам в Whatsapp', kaz: 'Бізге WhatsАpp арқылы жазыңыз'},

    loanFormTitleBefore: {rus: 'Заявка на очередь по ипотеке ', kaz: ''},
    loanFormTitleAfter: {rus: '', kaz: ' ипотекасы бойынша кезекке өтінім'},

    loanFormSubTitle: {rus: 'Оставьте заявку и наш менеджер перезвонит Вам', kaz: 'Өтінім қалдырыңыз, біздің менеджер Сізге қайта қоңырау шалады'},

    loanFormCity: {rus: 'Город недвижимости', kaz: 'Жылжымайтын мүлік орналасқан қала'},
    loanFormCityError: {rus: 'Пожалуйста, выберите город', kaz: 'Қаланы таңдаңыз'},
    loanFormPrice: {rus: 'Стоимость недвижимости', kaz: 'Жылжымайтын мүліктің құны'},
    loanFormFirstPayment: {rus: 'Первоначальный взнос', kaz: 'Бастапқы жарна'},
    loanFormSumLoan: {rus: 'Сумма кредита', kaz: 'Кредит сомасы'},
    loanFormPersonalData: {rus: 'Личные данные', kaz: 'Жеке деректер'},
    loanFormIIN: {rus: 'ИИН', kaz: 'ЖСН'},
    loanFormEnterIIN: {rus: 'Введите ИИН', kaz: 'ЖСН енгізіңіз'},
    loanFormFillField: {rus: 'Пожалуйста, заполните поле', kaz: 'Жолды толтырыңыз'},
    loanFormPhoneNumber: {rus: 'Номер телефона', kaz: 'Телефон нөмірі'},
    loanFormWeSendNumber: {rus: 'Мы отправим номер онлайн очереди на указанный номер', kaz: 'Онлайн кезектің нөмірін көрсетілген нөмірге жібереміз'},
    loanFormPhoneError: {rus: 'Введите номер по формату: +7 (7**) *** ** **', kaz: 'Нөмірі келесі форматқа енгізіңіз: +7 (7**) *** ** **'},
    loanFormAgreePersonalDataBeforeLink: {rus: 'Соглашаюсь с обработкой данных и ', kaz: 'Мен деректерді өңдеумен және '},
    loanFormAgreePersonalDataLink: {rus: 'с условиями передачи информации', kaz: 'ақпаратты беру шарттарымен'},
    loanFormAgreePersonalDataAfterLink: {rus: '', kaz: ' келісемін'},
    loanFormAgreePersonalDataDocument: {rus: 'https://www.bcc.kz/ipoteka-7-20-25-line/anketa-ru.pdf', kaz: 'https://www.bcc.kz/ipoteka-7-20-25-line/anketa-kz.pdf'},

    loanFormNecessaryAgree: {rus: 'Чтобы продолжить, необходимо ваше согласие', kaz: 'Жалғастыру үшін сіздің келісіміңіз қажет'},
    loanFormAgreeTerms: {rus: 'Ознакомлен с условиями онлайн очереди по ипотеке 7-20-25', kaz: '7-20-25 ипотекасы бойынша онлайн кезек шарттарымен таныстым'},
    loanFormGuaranteeSecure: {rus: 'Мы гарантируем безопасность и сохранность ваших данных', kaz: 'Біз сіздің деректеріңіздің қауіпсіздігі мен сақталуына кепілдік береміз'},
    loanFormContinue: {rus: 'Продолжить', kaz: 'Жалғастыру'},

    enterCodeSMS: {rus: 'Введите код из SMS', kaz: 'SMS-тен кодты енгізіңіз'},
    codeSentToPhoneBefore: {rus: 'На номер ', kaz: ''},
    codeSentToPhoneAfter: {rus: ' отправлено SMS-сообщение с кодом', kaz: ' нөміріне код көрсетілген SMS-хабарлама жіберілді'},
    sendCode: {rus: 'Отправить код', kaz: 'Кодты жіберу'},
    canSendCodeAgainInSecondBefore: {rus: 'Повторно отправить код можно через: ', kaz: ''},
    canSendCodeAgainInSecondAfter: {rus: '', kaz: ' секундтан кейін кодты қайта жіберуге болады'},
    wrongCode: {rus: 'Введен неверный код', kaz: 'Жарамсыз код енгізілді'},

    infoSomethingWrong: {rus: 'Что-то пошло не так...', kaz: 'Бірдеңе дұрыс болмады...'},
    infoRefreshPage: {rus: 'Пожалуйста, обновите страницу и повторите Ваш запрос', kaz: 'Сайтты жаңартып, сұрауыңызды қайта жіберіңіз'},
    infoYouHaveValidNumber: {rus: 'По Вашим данным уже зарегистрирован номер очереди', kaz: 'Сіздің деректеріңізге сәйкес кезек нөмірі бұрыннан тіркелген'},
    infoYouCantSendAgain: {rus: 'К сожалению, Вы не можете повторно подать заявку на очередь', kaz: 'Өкінішке орай, сіз кезекке қайта өтінім бере алмайсыз'},
    infoBackToSite: {rus: 'Вернуться на сайт', kaz: 'Сайтқа оралу'},

    infoLimitExceeded: {rus: 'К сожалению, лимит исчерпан', kaz: 'Өкінішке орай, лимит таусылды'},
    infoInfoWillPlacedOnResourses: {rus: 'Информация о возобновлении приёма новых заявок будет размещена на официальных ресурсах Банка', kaz: 'Жаңа өтінімдерді қабылдауды қайта бастау туралы ақпарат Банктің ресми ресурстарында орналастырылады'},

    infoNuberYourQueue: {rus: 'Номер Вашей очереди - ', kaz: 'Сіздің кезек нөміріңіз - '},
    infoWeSendadditionalSMS: {rus: 'Дополнительно отправим SMS сообщение с номером очереди', kaz: 'Бұған қосымша кезек нөмірі көрсетілген SMS хабарлама жібереміз'},
    infoWhatIsNext: {rus: 'Что делать дальше?', kaz: 'Әрі қарай не істеу керек?'},
    infoWaitCallToInvite: {rus: 'Дождитесь звонка от менеджера в течение 3-х рабочих дней и получите приглашение в отделение Банка', kaz: '3 жұмыс күні ішінде менеджердің қоңырауын күтіңіз және Банк бөлімшесіне шақыру алыңыз'},
    
    infoGoToOfficeBeforelink: {rus: 'В течение 10 рабочих дней просим подойти в отделение с ', kaz: '10 жұмыс күні ішінде '},
    infoGoToOfficeLink: {rus: 'необходимыми документами', kaz: 'қажетті құжаттармен'},
    infoGoToOfficeAfterLink: {rus: '', kaz: ' Банк бөлімшесіне келуіңізді сұраймыз'},

    infoImpossibleSendLimitExceeded: {rus: 'К сожалению, невозможно подать заявку, исчерпан лимит', kaz: 'Өкінішке орай, өтінім беру мүмкін емес, лимит таусылды'},
    
    infoYourOTP: {rus: 'Ваш код подтверждения: ', kaz: 'Сіздің растау кодыңыз: '},

    footerBankName: {rus: 'АО «БанкЦентрКредит»', kaz: '«Банк ЦентрКредит» АҚ'},
    allRightsSecured: {rus: ' Все права защищены.', kaz: 'Барлық құқықтар қорғалған.'},
    licenseBeforeLink: {rus: '', kaz: 'Банк операциялары мен өзге де операцияларды жүргізуге және бағалы қағаздар нарығында қызметті жүзеге асыруға ҚР Қаржы нарығын реттеу және дамыту агенттігі берген 03.02.2020 жылғы №1.2.25/195/34 '},
    licenseLink: {rus: 'Лицензия', kaz: 'лицензия'},
    licenseAfterLink: {rus: ' на проведение банковских и иных операций и деятельности на рынке ценных бумаг №1.2.25/195/34 от 03.02.2020, выданная Агентством РК по регулированию и развитию финансового рынка.', kaz: '.'},

    anounceTitle: {rus: ' Прием заявок на очередь откроется 12 июля 2023 года в 10:00 по времени Астаны', kaz: 'Кезекке өтінімдер 2023 жылғы 12 шілдеде Астана уақыты бойынша сағат 10:00-де ашылады'},
    anounceSubTitle: {rus: 'Здесь будет доступна форма для подачи заявки на очередь', kaz: 'Өтініш формасы осы жерде қолжетімді болады'},

}

